# KeyBasedTreeEntriesLoadContent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntriesLoadContent Methods
KeyBasedTreeEntriesLoadContent Class See Also
---
The KeyBasedTreeEntriesLoadContent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddEntry | Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function. |
| BuildEntries | Builds a KeyBasedTreeEntries object. |
| CanAddEntry | Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent. |
| Dispose | (Inherited from ExternalResourceLoadContent.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetEntries | Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLoadResults | Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEntriesBuilt | Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built. |
| Reset | Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace